<?php

return [

    'GROUPS' => 'Группы пользователей',
    'GROUP_CREATE' => 'Создать группу',
    'GROUP_UPDATE' => 'Редактировать группу',
    'ROLE_NOT_FOUND' => 'Группа не найдена',
    'RBAC' => 'Права доступа',

    /*
        Разрешить создавать нового пользователя
        Разрешение на создание любых данных нового пользователя.

        Разрешить редактировать данные пользователя
        Разрешение на редактирование любых данных всех пользователей.

        Разрешить удалять данные пользователя
        Разрешение на удаление любых данных всех пользователей.
    */

    /*
        'PERMISSION_USER_VIEW'   => '',
        'PERMISSION_USER_CREATE' => '',
        'PERMISSION_USER_DELETE' => '',
        'PERMISSION_USER_UPDATE' => '',
    */
];