<?php

return [

    'GROUPS' => 'Группы пользователей',
    'GROUP_CREATE' => 'Создать группу',
    'GROUP_UPDATE' => 'Редактировать группу',
    'ROLE_NOT_FOUND' => 'Группа не найдена',
    'RBAC' => 'Права доступа',

    'USER' => 'Пользователь',
    'ADMINISTRATOR' => 'Администратор',

    'PERMISSION_USER_UPDATE' => '<b>Разрешить редактировать данные пользователя</b><p>Разрешение на редактирование любых данных всех пользователей.</p>',
    'PERMISSION_USER_VIEW' => '<b>Разрешить просмотр данных пользователя</b><p>Разрешение на просмотр любых данных пользователя.</p>',
    'PERMISSION_USER_CREATE' => '<b>Разрешить создавать нового пользователя</b><p>Разрешение на создание любых данных нового пользователя.</p>',
    'PERMISSION_USER_DELETE' => '<b>Разрешить удалять данные пользователя</b><p>Разрешение на удаление любых данных всех пользователей.</p>',
    'PERMISSION_USER_MULTI_CONTROL' => '<b>Разрешить массовое управление пользователями</b><p>Разрешение на массовое управление всеми пользователями.</p>',
    'PERMISSION_USER_ACCESS_RULES_CONTROL' => '<b>Разрешить управление правами доступа</b><p>Разрешение дает возможность создавать, редактировать и удалять группы пользователей, а также присваивать разрешения.</p>',
    'PERMISSION_USER_ACTIONS_VIEW' => '<b>Разрешить просмотр действий пользователя</b><p>Разрешение дает возможность просматривать все совершенные действия пользователем</p>',
    'PERMISSION_USER_BANNED' => '<b>Разрешить просмотр информации о блокировках пользователей</b><p>Разрешение дает возможность просматривать всю историю блокировки пользователем</p>',
];